uhnp/src/InformationRegisters/тн_ОшибкиПроведенияДокументовПриЗагрузке/тн_ОшибкиПроведенияДокументовПриЗагрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ОшибкиПроведенияДокументовПриЗагрузке</name>
  <comment>Выполнение задач №000044682</comment>
  <resources>
    <name>ИДСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТребуемоеСостояниеПроведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекущееСостояниеПроведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПерепроведение</name>
    <comment>Выполнение задач №000045823</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокИсправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПоследнейПопыткиИсправления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибкиПроведения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>УниверсальнаяДатаСообщения</name>
    <comment>//Сафиуллина З.Р. 05.11.2025 Выполнение задач №000055693</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяСледующейОбработки</name>
    <comment>// Чекордина Ирина 20.11.2025 Выполение задач №000055693</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <comment>//Качикина 18.12.2025 Выполнение задач №000056120 </comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <comment>//Качикина 18.12.2025 Выполнение задач №000056120 </comment>
    <type>
      <types>EnumRef.тн_ТипыОшибокОбмена</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументСсылка</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/тн_ТипыОшибокОбмена/тн_ТипыОшибокОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тн_ТипыОшибокОбмена</name>
  <comment>//Качикина 18.12.2025 Выполнение задач №000056120 </comment>
  <enumValues>
    <name>ОшибкаПроведения</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаРаспроведенияПометкиНаУдаление</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнениеОбъекта</name>
  </enumValues>
  <enumValues>
    <name>НекорректныйОбъектРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытыйПериод</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/тн_ОшибкиПроведенияДокументовПриЗагрузке/ManagerModule.bsl
//Качикина 21.12.2025 Выполнение задач №000056120
Функция ТипОшибкиПоОписанию(ОписаниеОшибки) Экспорт
	
	ТекстОшибки = НРег(ОписаниеОшибки);
	
	Если СтрНайти(ТекстОшибки, "в закрытом периоде" ) <> 0
		Или СтрНайти(ТекстОшибки, "в запрещенном периоде") <> 0 Тогда
		
		ТипОшибки = Перечисления.тн_ТипыОшибокОбмена.ЗакрытыйПериод;	
		
	ИначеЕсли СтрНайти(ТекстОшибки, "поля документа не заполнены") <> 0 Тогда
		
		ТипОшибки = Перечисления.тн_ТипыОшибокОбмена.ЗаполнениеОбъекта;	
		
	ИначеЕсли СтрНайти(ТекстОшибки, "объект расчетов") <> 0 Тогда
		
		ТипОшибки = Перечисления.тн_ТипыОшибокОбмена.НекорректныйОбъектРасчетов;
		
	ИначеЕсли СтрНайти(ТекстОшибки, "не удалось провести") <> 0
		Или СтрНайти(ТекстОшибки, "Ошибка при выполнении обработчика - 'ОбработкаПроведения'") <> 0 Тогда
		
		ТипОшибки = Перечисления.тн_ТипыОшибокОбмена.ОшибкаПроведения;
		
	Иначе
		ТипОшибки = Перечисления.тн_ТипыОшибокОбмена.Прочее;	
	КонецЕсли;
	
	Возврат ТипОшибки;	

КонецФункции
